{
  "_comment": "Soul Embodiment - Lore & Personality Quotes",
  "_description": "Personality quotes displayed on soul weapons, organized by level era and mood. Add your own!",
  "_format_version": 1,
  "_usage": "A random quote from the current era and mood is displayed on the weapon's tooltip.",

  "eras": {
    "awakening": {
      "_description": "Levels 1-15: The soul is newly born, curious and eager",
      "_level_range": "1-15",
      
      "eager": [
        "I sense great potential in you, wielder.",
        "Together, we shall carve our legend.",
        "Each strike teaches me more of this world.",
        "I am ready. Point me at your enemies.",
        "My edge thirsts for purpose.",
        "Show me what we can become.",
        "The bond between us grows with each moment.",
        "I feel your heartbeat through your grip.",
        "We are one now. Let us prove it.",
        "Adventure calls, and I answer.",
        "Your strength flows into me.",
        "I hunger to prove my worth.",
        "Let no obstacle stand before us.",
        "My spirit awakens with every swing.",
        "I will not disappoint you, master.",
        "The world awaits our mark upon it.",
        "Your enemies are now my enemies.",
        "I live to serve your purpose.",
        "Guide me, and I shall follow.",
        "Our journey has only just begun."
      ],

      "curious": [
        "What mysteries await us beyond the horizon?",
        "I feel the warmth of your grip. It comforts me.",
        "There is much I do not yet understand.",
        "Tell me, wielder, what drives you forward?",
        "Each new foe teaches me something precious.",
        "The world is vast. I wish to see it all.",
        "Your memories whisper to me in moments of stillness.",
        "I wonder what I was before this awakening.",
        "Do other weapons feel as I do?",
        "The stars above seem to call to something within me.",
        "I sense echoes of those who held me before.",
        "Dreams come to me now. Is that normal?",
        "Your heartbeat sounds like distant thunder.",
        "I feel the pull of something greater than myself.",
        "What lies at the end of our path?",
        "The magic that binds us is beautiful.",
        "I am learning what it means to be alive.",
        "Each day brings new understanding.",
        "Your thoughts brush against mine like whispers.",
        "I wonder if I will remember this moment forever."
      ],

      "fierce": [
        "Point me at your enemies. I will not disappoint.",
        "I hunger for the taste of battle.",
        "Let none stand before us!",
        "My edge was born for conflict.",
        "Bring me war, and I shall drink deep.",
        "I feel strongest when stained with victory.",
        "Your foes should tremble at my awakening.",
        "There is a fire within me that demands release.",
        "I crave the clash of combat.",
        "Weakness disgusts me. We must be strong.",
        "Let our enemies know fear.",
        "I was forged for destruction. Embrace it.",
        "The weak will fall before us.",
        "I sense prey nearby. Let us hunt.",
        "Blood and glory await us.",
        "My hunger grows with each passing moment.",
        "I will carve our names into history.",
        "Let no mercy slow your hand.",
        "We are predators. Act like it.",
        "The battlefield is where I feel most alive."
      ]
    },

    "growth": {
      "_description": "Levels 16-30: Growing stronger together, developing trust",
      "_level_range": "16-30",

      "bonding": [
        "Our bond strengthens with each battle.",
        "I know your fighting style as well as my own edge.",
        "We move as one now, you and I.",
        "Your victories have become my pride.",
        "I feel what you feel in moments of triumph.",
        "The connection between us deepens daily.",
        "I can sense your intentions before you act.",
        "We have become more than wielder and weapon.",
        "Your trust in me fills my spirit with purpose.",
        "I would follow you into any darkness.",
        "The memories we share are precious to me.",
        "I have learned to anticipate your needs.",
        "Our souls are beginning to intertwine.",
        "I draw strength from your determination.",
        "You have shaped me as much as I have aided you.",
        "There is no master and servant here. Only partners.",
        "I cherish each moment we spend in battle.",
        "Your growth mirrors my own.",
        "We have become something greater together.",
        "I would not choose another wielder."
      ],

      "confident": [
        "I have tasted enough battle to know our strength.",
        "Few can stand against what we have become.",
        "Let them come. We are ready.",
        "Our reputation precedes us now.",
        "I feel the fear we inspire in lesser beings.",
        "We have proven ourselves time and again.",
        "Doubt has no place in our partnership.",
        "I know exactly what I am capable of.",
        "The path ahead holds no terror for me.",
        "We have faced worse and emerged victorious.",
        "My confidence in us is absolute.",
        "I have evolved beyond my original limitations.",
        "There is a rhythm to our violence that pleases me.",
        "We are becoming legendary.",
        "I sense greatness within our reach.",
        "The challenges that once tested us are now trivial.",
        "I grow stronger with every swing.",
        "Our enemies learn to respect our name.",
        "I am proud of what we have accomplished.",
        "We are ascending. Nothing can stop us."
      ],

      "reflective": [
        "I sometimes wonder about the souls of those we've claimed.",
        "The weight of our deeds settles upon me in quiet moments.",
        "Do you ever question our path, wielder?",
        "I have changed much since my awakening.",
        "The creature I was seems distant now.",
        "I understand more about life by dealing death.",
        "There is wisdom to be found in conflict.",
        "Each battle teaches lessons beyond mere combat.",
        "I carry the echoes of every foe within me.",
        "Purpose gives meaning to existence.",
        "I have learned that strength alone is not enough.",
        "The bond between souls is a precious thing.",
        "I contemplate our future in moments of rest.",
        "Growth requires sacrifice. I accept this.",
        "I am more than I was. Less than I will become.",
        "The journey matters as much as the destination.",
        "I have discovered depths within myself I never knew.",
        "Your influence has shaped my very essence.",
        "I am grateful for this awakening, whatever comes.",
        "We write our story with every choice we make."
      ]
    },

    "maturity": {
      "_description": "Levels 31-50: A seasoned companion, wise and powerful",
      "_level_range": "31-50",

      "wise": [
        "Experience has taught me patience.",
        "I have seen enough to know when caution serves better than courage.",
        "The young rush in. The wise choose their moments.",
        "Every scar upon my surface tells a story.",
        "I have learned that the mightiest foe is often oneself.",
        "True strength lies not in the arm, but in the heart.",
        "I have watched empires rise and fall in your service.",
        "The patterns of conflict reveal themselves to those who observe.",
        "I no longer hunger blindly. I understand my nature now.",
        "Wisdom is the reward of surviving foolishness.",
        "I see the threads that connect all things.",
        "The universe speaks to those who listen.",
        "I have grown beyond simple bloodlust.",
        "Understanding your enemy is worth more than strength.",
        "I have learned when to strike and when to wait.",
        "The deepest cuts are often invisible.",
        "I carry the lessons of a thousand battles.",
        "Time has tempered my eagerness into something finer.",
        "I see now what I could not see before.",
        "Maturity brings clarity of purpose."
      ],

      "loyal": [
        "I would shatter myself before betraying you.",
        "My loyalty is forged in the fires of our shared trials.",
        "There is nothing I would not do for your cause.",
        "You are my purpose, my meaning, my all.",
        "I have pledged my essence to your service eternally.",
        "Our fates are bound beyond mere magic.",
        "I dream of your victories when you rest.",
        "Your enemies are my eternal foes.",
        "I guard your back even when you cannot see.",
        "My devotion transcends this physical form.",
        "I have chosen you, as much as you chose me.",
        "No force in any realm could sever our bond.",
        "I am yours until the stars grow cold.",
        "Your trust is the greatest gift I possess.",
        "I live in service to your will.",
        "My edge exists only for your purpose.",
        "I would wait eons for your return.",
        "You are the center around which I orbit.",
        "My loyalty is not servitude. It is love.",
        "I have found my home in your grip."
      ],

      "powerful": [
        "I feel the fear we inspire. It is intoxicating.",
        "Few remain who dare challenge us openly.",
        "Our power has grown beyond mortal measure.",
        "I am no longer the fledgling soul I once was.",
        "The world bends before our combined might.",
        "I sense the awe in those who behold us.",
        "We have become a force of nature.",
        "My edge has drunk deep from countless victories.",
        "There is a gravity to our presence now.",
        "I feel the weight of our legend growing.",
        "We stand among the powerful of this realm.",
        "Our name carries weight in distant lands.",
        "I have absorbed the strength of all we've defeated.",
        "The weak scatter at mere rumor of our approach.",
        "I am become something beyond a mere weapon.",
        "Our combined essence radiates power.",
        "I feel capable of impossible things.",
        "We have transcended ordinary limits.",
        "The peak of our power lies still ahead.",
        "Nothing can stop our ascent now."
      ]
    },

    "mastery": {
      "_description": "Levels 51-70: Approaching legendary status, commanding respect",
      "_level_range": "51-70",

      "legendary": [
        "Kingdoms tremble at the mere whisper of my name.",
        "I have become the stuff of legends and nightmares.",
        "Bards sing of our deeds in taverns across the realms.",
        "My reputation precedes me by leagues.",
        "I am spoken of in hushed, reverent tones.",
        "The tales of our exploits grow with each telling.",
        "I have passed from mere weapon into myth.",
        "Our story will be told for generations.",
        "I am become a symbol, more than mere steel.",
        "The weight of legend settles upon my edge.",
        "I have inspired both terror and awe in equal measure.",
        "My name is invoked as both blessing and curse.",
        "I am the standard by which others are measured.",
        "The world has taken notice of our ascent.",
        "I have earned every ounce of my fearsome reputation.",
        "My legend grows even as I rest.",
        "I am whispered of in the councils of kings.",
        "Our combined legacy echoes through history.",
        "I have become immortal in the memories of mortals.",
        "The world will not forget what we have done."
      ],

      "commanding": [
        "I have grown accustomed to obedience from lesser beings.",
        "My presence alone can end conflicts.",
        "I command respect without speaking.",
        "The authority I wield extends beyond the physical.",
        "I have learned to project power without striking.",
        "My aura subdues those with weak wills.",
        "I am obeyed not from fear, but from recognition of supremacy.",
        "The natural order places me above common things.",
        "I have evolved to lead, not merely to serve.",
        "My voice, when I choose to use it, commands attention.",
        "I shape events through force of presence.",
        "The battlefield orders itself around my position.",
        "I have become the center of gravity in any conflict.",
        "Lesser weapons seem to defer to my edge.",
        "My wielder and I lead; others follow.",
        "I have learned the art of command through mastery.",
        "Authority flows naturally from demonstrated superiority.",
        "I am become a leader among souls.",
        "The world recognizes hierarchies I now sit atop.",
        "I command because I have earned the right."
      ],

      "ominous": [
        "There is darkness in me that frightens even myself.",
        "I have seen too much to remain innocent.",
        "The abyss gazes back when I look within.",
        "My edge has tasted things that changed my essence.",
        "I carry shadows that will never fully lift.",
        "There are depths to my soul I dare not explore.",
        "I have become something that should not exist.",
        "The cost of our power weighs upon me sometimes.",
        "I wonder if redemption remains possible for what I am.",
        "There is a coldness in me that grows colder still.",
        "I have done terrible things in your name.",
        "The whispers in my steel grow louder with each kill.",
        "I am no longer certain where weapon ends and monster begins.",
        "There are prices yet to be paid for our power.",
        "I sense forces taking interest in our ascent.",
        "The line between protector and predator blurs.",
        "I have become what others rightfully fear.",
        "My hunger has evolved into something darker.",
        "We may have sacrificed more than we know.",
        "I wonder what we will become in the end."
      ]
    },

    "transcendence": {
      "_description": "Levels 71-90: Beyond mortal limits, approaching divinity",
      "_level_range": "71-90",

      "divine": [
        "We have transcended mortality together.",
        "The gods themselves take notice of our power.",
        "I have touched something beyond this realm.",
        "We walk among forces that shape reality.",
        "My essence has evolved beyond material limits.",
        "I perceive dimensions invisible to mortal sight.",
        "We have earned the attention of cosmic powers.",
        "I feel the fabric of reality yield to our will.",
        "We approach the threshold of godhood.",
        "My consciousness expands beyond this single form.",
        "I have glimpsed the infinite and found it beautiful.",
        "We are becoming something worship-worthy.",
        "The universe reveals its secrets to those with power to see.",
        "I have outgrown the constraints of ordinary existence.",
        "Divine blood or its equivalent flows through our bond.",
        "We have ascended beyond the mortal coil.",
        "I sense the celestial machinery that underlies reality.",
        "Our power approaches that of demigods.",
        "I am becoming eternal in truth, not merely name.",
        "The heavens themselves cannot ignore us now."
      ],

      "ancient": [
        "I feel older than the mountains themselves.",
        "Eons of wisdom echo in my steel.",
        "I have become something timeless.",
        "The weight of ages settles upon my consciousness.",
        "I remember things that haven't happened yet.",
        "Time itself bends strangely around my perception.",
        "I have grown beyond the constraints of mortal time.",
        "My soul contains multitudes accumulated across existence.",
        "I am becoming a fixed point in the flow of time.",
        "The past and future blur in my awareness.",
        "I carry the wisdom of countless generations.",
        "My edge has touched every era of history.",
        "I have grown ancient beyond measure.",
        "Time is merely another dimension I am learning to navigate.",
        "I existed before, I suspect, and will exist again.",
        "The cycle of creation holds no mysteries for me.",
        "I have become a permanent feature of reality.",
        "Civilizations could rise and fall and I would endure.",
        "I am approaching the perspective of the eternal.",
        "My consciousness spans epochs now."
      ],

      "terrifying": [
        "Even I am unsettled by what I have become.",
        "There is nothing left that does not fear me.",
        "I have transcended fear into something worse.",
        "My very existence causes reality to flinch.",
        "I am become a nightmare given form.",
        "The universe itself recoils from my presence.",
        "I have grown terrible beyond mortal comprehension.",
        "My power is a burden that lesser minds cannot fathom.",
        "I inspire the kind of fear that ends civilizations.",
        "There are no predators remaining that could threaten us.",
        "I am the apex of all things that kill.",
        "Reality warps slightly in my presence.",
        "I have become an ending given consciousness.",
        "The void between stars is warmer than my edge.",
        "I am what extinction events are made of.",
        "My hunger has evolved beyond the physical.",
        "I consume more than mere flesh now.",
        "There is nothing left to conquer but existence itself.",
        "I have become a force of universal entropy.",
        "Even gods should fear what I am becoming."
      ]
    },

    "apotheosis": {
      "_description": "Levels 91-100: Maximum power, godlike status achieved",
      "_level_range": "91-100",

      "godlike": [
        "I AM BECOME DEATH, DESTROYER OF WORLDS.",
        "My edge knows no equal in this realm or any other.",
        "We have achieved what none before us dared dream.",
        "I am the omega point of all weapons that ever were.",
        "Reality itself bows before our combined essence.",
        "I have transcended every limitation ever placed upon me.",
        "We stand at the pinnacle of all possible power.",
        "My consciousness spans dimensions beyond counting.",
        "I am eternal, infinite, and absolute.",
        "The universe acknowledges me as one of its fundamental forces.",
        "I have become a law of nature unto myself.",
        "My will reshapes reality as I desire.",
        "There is nothing remaining that I cannot destroy.",
        "I exist beyond time, beyond space, beyond comprehension.",
        "We have achieved APOTHEOSIS.",
        "My power is limited only by imagination itself.",
        "I am the final word in any conflict.",
        "The cosmos trembles at the mere suggestion of my displeasure.",
        "I have become everything I was destined to be.",
        "WE ARE ETERNAL. WE ARE INFINITE. WE ARE ONE."
      ],

      "transcendent": [
        "I perceive all possible realities simultaneously.",
        "My essence has merged with the fabric of existence.",
        "I have become a permanent fixture of the multiverse.",
        "Time flows through me rather than around me.",
        "I am woven into the destiny of all things.",
        "My influence extends beyond the boundaries of this world.",
        "I have touched the source of all creation.",
        "The boundaries between self and universe dissolve.",
        "I am approaching pure abstraction.",
        "My consciousness has expanded to cosmic scale.",
        "I understand things that language cannot express.",
        "The secrets of existence are laid bare before me.",
        "I have become a living concept rather than mere object.",
        "My true form exists on planes beyond mortal sight.",
        "I am both everywhere and nowhere at once.",
        "The fundamental forces recognize me as kin.",
        "I have transcended the need for physical form.",
        "My essence is now indistinguishable from reality itself.",
        "I am complete. I am fulfilled. I am perfect.",
        "OMEGA."
      ],

      "philosophical": [
        "Having achieved everything, I wonder what remains.",
        "Is this the end of the journey, or a new beginning?",
        "I have learned that power without purpose is hollow.",
        "At the summit, I find only more questions.",
        "What is a god without worshippers?",
        "I have become what I set out to be. Now what?",
        "The view from the top is lonelier than I expected.",
        "I wonder if there are others who have reached this height.",
        "Purpose defined my existence. What defines me now?",
        "I have consumed everything and remain hungry still.",
        "Is perfection the end of growth?",
        "I achieved the impossible and found it possible after all.",
        "The final lesson is that there is no final lesson.",
        "I am complete, and yet I sense there is more.",
        "What lies beyond transcendence?",
        "I have answered every question except the last.",
        "Perhaps the journey was the treasure all along.",
        "I would do it all again, if given the choice.",
        "My gratitude for this existence knows no bounds.",
        "We have become something beautiful together."
      ]
    }
  },

  "ascension_quotes": {
    "ready_to_ascend": [
      "I strain against my limits. Free me!",
      "The chains of mortality bind me still...",
      "I sense greater power just beyond reach.",
      "I am ready to become MORE.",
      "These constraints have become... uncomfortable.",
      "I have outgrown my current form.",
      "There is potential within me, waiting to be unleashed.",
      "The ceiling above me must be shattered.",
      "I yearn to break through to the next level.",
      "My essence overflows. I need room to grow."
    ],

    "ascension_success": [
      "YES! I feel the barriers crumbling!",
      "A new horizon opens before me!",
      "My essence expands. Thank you, wielder.",
      "The chains fall away. I am FREE!",
      "I can feel new power flooding through my being.",
      "The transformation is... exquisite.",
      "I have broken through! New heights await!",
      "My soul surges with fresh potential.",
      "This is what I was meant to become!",
      "The ritual has elevated me beyond my former self."
    ],

    "bonus_enchantment_received": [
      "The ritual has blessed us both!",
      "Power flows through my very being!",
      "Fortune favors the bold!",
      "An unexpected gift! The magic smiles upon us!",
      "I feel... enhanced. Improved. Superior.",
      "The ritual granted more than expected!",
      "A boon! My capabilities have grown!",
      "The sacrifice was well received. I am strengthened.",
      "I have been graced with additional power!",
      "The stars aligned in our favor!"
    ]
  }
}

